## Assignment Pandas 1

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [17]:
import pandas as pd
data = [4, 8, 15, 16, 23,42]
data

[4, 8, 15, 16, 23, 42]

In [18]:
series = pd.Series(data)
print(series)
type(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
students_name = ["Arghya","Ayan","Udit","Subham","Santanu","Aditi","Priyanka","Himaghna","Sougata","Sudipta"]
S = pd.Series(students_name)
print(S)
type(S)

0      Arghya
1        Ayan
2        Udit
3      Subham
4     Santanu
5       Aditi
6    Priyanka
7    Himaghna
8     Sougata
9     Sudipta
dtype: object

pandas.core.series.Series

#### Q3. Create a Pandas DataFrame that contains the following data:

|Name|Age|Gender|
|:-:|:-:|:-:|
|**Alice**|25|Female|
|**Bob**|30|Male|
|**Claire**|27|Female|

#### Then, print the DataFrame.

In [4]:
Details = {"Name":["Alice","Bob","Claire"], "Age":[25,30,27], "Gender":["Female","Male","Female"]}

In [11]:
df = pd.DataFrame(Details)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
type(df)

pandas.core.frame.DataFrame

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: In Pandas, a DataFrame is a two-dimensional labeled data structure that is used to store and manipulate tabular data. It can be thought of as a collection of Pandas Series objects that share the same index. Each column in a DataFrame is a Pandas Series.

A Pandas Series, on the other hand, is a one-dimensional labeled array that can hold data of any type.

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans:
- head(): This function is used to display the first few rows of the DataFrame.
- tail(): This function is used to display the last few rows of the DataFrame.
- describe(): This function provides a summary of the statistics for each column of the DataFrame, such as count, mean, standard deviation, minimum, and maximum values.

In [7]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [8]:
df.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans: DataFrames are both value-mutable and size-mutable. Series, by contrast, is only value-mutable, not size-mutable. The length of a Series cannot be changed although the values can be changed.

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [15]:
import pandas as pd
students_name = pd.Series(["Arghya","Ayan","Udit","Subham","Santanu"])
age = pd.Series([23,22,24,21,24])                          
email_id = pd.Series(["arghya@gmail.com","ayan@gmail.com","udit@gmail.com","subham@gmail.com","santanu@gmail.com"])

student_details = {"students_name" : students_name, "age" : age, "email_id" : email_id}

In [16]:
df = pd.DataFrame(student_details)
df

  students_name  age           email_id
0        Arghya   23   arghya@gmail.com
1          Ayan   22     ayan@gmail.com
2          Udit   24     udit@gmail.com
3        Subham   21   subham@gmail.com
4       Santanu   24  santanu@gmail.com

In this example, we create three Series "students_name", "age" and "email_id" containing  string, numerical, string data respectively. We then create a dictionary "student_details" with the column names as keys and the Series as values. Finally, we pass the dictionary to the "pd.DataFrame()" function to create a DataFrame "df".

The resulting DataFrame has three columns "students_name", "age" and "email_id", corresponding to the three Series. We can see that the elements of each Series have been aligned vertically in the DataFrame, and the index values of each Series have been preserved as row labels in the DataFrame.